fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <comment>Обслуживание клиента</comment>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ ВКМ
	ПроверитьУсловияПроведения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	//-- ВКМ
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	//++ ВКМ
	СформироватьДвиженияПоВыполненнымРаботам();
	//-- ВКМ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//++ ВКМ
		
		ЭтоНовыйДокумент = Не ЗначениеЗаполнено(Ссылка);
		НужноУведомление = ЭтоНовыйДокумент;
		
		Если Не ЭтоНовыйДокумент Тогда
			
			СтарыеЗначения = ПолучитьСохраненныеЗначенияДляУведомления();
			
			НужноУведомление = (ДатаПроведенияРабот <> СтарыеЗначения.ДатаПроведенияРабот)
	Или (ВремяНачалаРаботПлан <> СтарыеЗначения.ВремяНачалаРабот)
	Или (ВремяОкончанияРаботПлан <> СтарыеЗначения.ВремяОкончанияРабот)
	Или (Специалист <> СтарыеЗначения.Специалист);
			
		КонецЕсли;
		
		Если НужноУведомление Тогда
			ДополнительныеСвойства.Вставить("СоздатьУведомлениеТелеграм", Истина);
			ДополнительныеСвойства.Вставить("ЭтоНовыйДокумент", ЭтоНовыйДокумент);
		КонецЕсли;
		
	
	//-- ВКМ
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//++ ВКМ
	Если ДополнительныеСвойства.Свойство("СоздатьУведомлениеТелеграм") Тогда
		ЭтоНовыйДокумент = Ложь;
		ДополнительныеСвойства.Свойство("ЭтоНовыйДокумент", ЭтоНовыйДокумент);
		ТекстУведомления = ВКМ_Телеграм.СформироватьТекстУведомленияОбОбслуживании(ЭтотОбъект, ЭтоНовыйДокумент);
		ВКМ_Телеграм.ДобавитьУведомление(ТекстУведомления);
	КонецЕсли;
	//-- ВКМ
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ПроверитьУсловияПроведения(Отказ)
	
	Если Не ЗначениеЗаполнено(Специалист) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен специалист.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Специалист", , Отказ);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен договор.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Договор", , Отказ);
		Возврат;
	КонецЕсли;
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Договор,
		"ВидДоговора, ВКМ_ДатаНачалаДействия, ВКМ_ДатаОкончанияДействия, ВКМ_СтоимостьЧасаРаботы");
	
	Если РеквизитыДоговора.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ТекстСообщения = НСтр("ru = 'Договор должен быть договором абонентского обслуживания.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Договор", , Отказ);
		Возврат;
	КонецЕсли;
	
	ДатаДокумента = НачалоДня(Дата);
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.ВКМ_ДатаНачалаДействия)
		И ДатаДокумента < НачалоДня(РеквизитыДоговора.ВКМ_ДатаНачалаДействия) Тогда
		
		ТекстСообщения = НСтр("ru = 'Дата документа меньше даты начала действия договора.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , , Отказ);
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.ВКМ_ДатаОкончанияДействия)
		И ДатаДокумента > НачалоДня(РеквизитыДоговора.ВКМ_ДатаОкончанияДействия) Тогда
		
		ТекстСообщения = НСтр("ru = 'Дата документа больше даты окончания действия договора.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, , , Отказ);
		Возврат;
		
	КонецЕсли;
	
	УсловияОплаты = ПолучитьПроцентОтРаботСотрудника(Специалист, Дата);
	Если Не УсловияОплаты.ЕстьУсловияОплаты Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно провести документ: для сотрудника не задано условие оплаты на дату документа.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Специалист", , Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
Процедура СформироватьДвиженияПоВыполненнымРаботам()
	
	Если Не ЗначениеЗаполнено(Специалист) Тогда
		Возврат;
	КонецЕсли;
	
	УсловияОплаты = ПолучитьПроцентОтРаботСотрудника(Специалист, Дата);
	Если Не УсловияОплаты.ЕстьУсловияОплаты Тогда
		Возврат;
	КонецЕсли;
	
	СтавкаЧаса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботы");
	
	Для Каждого СтрокаРабот Из ВыполненныеРаботы Цикл
		
		ЧасыКОплате = СтрокаРабот.ЧасыКОплатеКлиенту;
		Если ЧасыКОплате <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДвижениеКлиенту = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		ДвижениеКлиенту.Период = Дата;
		ДвижениеКлиенту.Клиент = Клиент;
		ДвижениеКлиенту.Договор = Договор;
		ДвижениеКлиенту.КоличествоЧасов = ЧасыКОплате;
		ДвижениеКлиенту.СуммаКОплате = ЧасыКОплате * СтавкаЧаса;
		
		ДвижениеСотруднику = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		ДвижениеСотруднику.Период = Дата;
		
		ДвижениеСотруднику.Сотрудник = Специалист;
		ДвижениеСотруднику.ЧасовКОплате = ЧасыКОплате;
		ДвижениеСотруднику.СуммаКОплате = Окр(ЧасыКОплате * СтавкаЧаса * УсловияОплаты.ПроцентОтРабот / 100, 2);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСохраненныеЗначенияДляУведомления()
	
	Результат = Новый Структура(
		"ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист",
		Дата(1, 1, 1),
		Дата(1, 1, 1),
		Дата(1, 1, 1),
		Справочники.Пользователи.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обслуживание.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	Обслуживание.ВремяНачалаРаботПлан КАК ВремяНачалаРабот,
	|	Обслуживание.ВремяОкончанияРаботПлан КАК ВремяОкончанияРабот,
	|	Обслуживание.Специалист КАК Специалист
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК Обслуживание
	|ГДЕ
	|	Обслуживание.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПроцентОтРаботСотрудника(Сотрудник, ДатаДокумента)
Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Условия.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|		&ДатаДокумента,
	|		Сотрудник = &Сотрудник) КАК Условия";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ЕстьУсловияОплаты, ПроцентОтРабот", Истина, Выборка.ПроцентОтРабот);
	КонецЕсли;
	
	Возврат Новый Структура("ЕстьУсловияОплаты, ПроцентОтРабот", Ложь, 0);
КонецФункции
Функция РассчитатьЧасыПоВремени(ВремяНачала, ВремяОкончания)
	Если Не ЗначениеЗаполнено(ВремяНачала) Или Не ЗначениеЗаполнено(ВремяОкончания) Тогда
		Возврат 0;
	КонецЕсли;
	Секунд = ВремяОкончания - ВремяНачала;
	Если Секунд <= 0 Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Окр(Секунд / 3600, 2);
КонецФункции
#КонецОбласти
#КонецЕсли
